ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_lpost_regs.xml
<module id="LPOST_REGS" HW_revision="" description="LPOST Registers">
	<register id="REVISION" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="IP Revision tie-off value">
		<bitfield id="MINOR" description="Minor Revision Number" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="Custom Module Number" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="MAJOR" description="Major Revision Number" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="FUNC" description="Functional Release Number" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="SCHEME" description="Defines Scheme for Module" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="LPOST_CONTROL" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Register to start the power-on self-test operation.">
		<bitfield id="GO" description="Start the self-test operation" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="LPOST_CONFIG" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Register to configure the coverage for the power-on self-test operation.">
		<bitfield id="COVERAGE" description="Coverage configuration for the power on self-test" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="LPOST_STATUS" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="Register indicating the status of power-on self-test operation.">
		<bitfield id="DONE" description="LPOST completion status. " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PASS" description="LPOST test pass/fail status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="TIMEOUT" description="LPOST test timeout status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SANITY_TEST_PASS" description="LPOST sanity test status" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="SANITY_TIMEOUT_PASS" description="LPOST timeout test status" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="RAW_PORESETn_STATUS" description="The bit will indicate RAW PORESETn Status" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="LPOST_STATUS_CLEAR" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="Register to clear the LPOST Status">
		<bitfield id="DONE" description="DONE status clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PASS" description="PASS status clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TIMEOUT" description="TIMEOUT status clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SANITY_TEST_PASS" description="SANITY_TEST_PASS status clear" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SANITY_TIMEOUT_PASS" description="SANITY_TIMEOUT_PASS status clear" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="RAW_PORESETn_STATUS" description="Clear bit for RAW_PORESETn_STATUS" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="LPOST_LOCK" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="Register to lock the LPOST register configurations">
		<bitfield id="LPOST_CONTROL" description="Register lock configuration" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LPOST_CONFIG" description="Register lock configuration" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LPOST_STATUS_CLEAR" description="Register lock configuration" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="PARITY_TEST" description="Register lock configuration" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
	<register id="LPOST_COMMIT" width="32" page="0" offset="0x78" instances="1" instaddr="4" internal="0" description="Register to commit the LPOST register configuration">
		<bitfield id="LPOST_CONTROL" description="Register commit configuration" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LPOST_CONFIG" description="Register commit configuration" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LPOST_STATUS_CLEAR" description="Register lock configuration" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="PARITY_TEST" description="Register commit configuration" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
</module>
